bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY13.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATtiny13V-10PU" speedmax="10000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="PDIP8" pinout="PDIP8_SOIC8"/>
        <variant ordercode="ATtiny13V-10SU" speedmax="10000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="SOIC8" pinout="PDIP8_SOIC8"/>
        <variant ordercode="ATtiny13V-10SSU" speedmax="10000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="SOIC8" pinout="PDIP8_SOIC8"/>
        <variant ordercode="ATtiny13V-10MU" speedmax="10000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="MLF20" pinout="MLF20"/>
        <variant ordercode="ATtiny13V-10MMU" speedmax="10000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="MLF10" pinout="MLF10"/>
        <variant ordercode="ATtiny13-20PU" speedmax="20000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="PDIP8" pinout="PDIP8_SOIC8"/>
        <variant ordercode="ATtiny13-20SU" speedmax="20000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="SOIC8" pinout="PDIP8_SOIC8"/>
        <variant ordercode="ATtiny13-20SSU" speedmax="20000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="SOIC8" pinout="PDIP8_SOIC8"/>
        <variant ordercode="ATtiny13-20MU" speedmax="20000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="MLF20" pinout="MLF20"/>
        <variant ordercode="ATtiny13-20MMU" speedmax="20000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5"
                 package="MLF10" pinout="MLF10"/>
    </variants>
    <device name="ATtiny13" architecture="AVR8" family="tinyAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x0400">
                <memory-segment start="0x0000" size="0x0400" type="flash" rw="RW" exec="1" name="FLASH"
                                pagesize="0x20"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0002">
                <memory-segment start="0" size="0x0002" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x00a0">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x0040" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0060" size="0x0040" type="ram" external="false"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0040">
                <memory-segment start="0x0000" size="0x0040" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                pagesize="0x04"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="2">
                <memory-segment start="0" size="2" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="ADC">
                <instance name="ADC" caption="Analog-to-Digital Converter">
                    <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                    caption="Analog-to-Digital Converter"/>
                    <signals>
                        <signal group="ADC" index="0" function="default" pad="PA0"/>
                        <signal group="ADC" index="1" function="default" pad="PA1"/>
                        <signal group="ADC" index="2" function="default" pad="PA2"/>
                        <signal group="ADC" index="3" function="default" pad="PA3"/>
                    </signals>
                </instance>
            </module>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                    caption="Analog Comparator"/>
                    <signals>
                        <signal group="AIN" index="1" pad="PB1" function="default"/>
                        <signal group="AIN" index="0" pad="PB0" function="default"/>
                    </signals>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                    caption="EEPROM"/>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                    caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V2"/>
                        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
                    </parameters>
                </instance>
            </module>
            <module name="PORT">
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PB0" index="0"/>
                        <signal group="P" function="default" pad="PB1" index="1"/>
                        <signal group="P" function="default" pad="PB2" index="2"/>
                        <signal group="P" function="default" pad="PB3" index="3"/>
                        <signal group="P" function="default" pad="PB4" index="4"/>
                        <signal group="P" function="default" pad="PB5" index="5"/>
                    </signals>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                    caption="External Interrupts"/>
                    <signals>
                        <signal group="PCINT5" pad="PB5" function="default"/>
                        <signal group="PCINT4" pad="PB4" function="default"/>
                        <signal group="PCINT3" pad="PB3" function="default"/>
                        <signal group="PCINT2" pad="PB2" function="default"/>
                        <signal group="PCINT1" pad="PB1" function="default"/>
                        <signal group="INT" pad="PB1" function="default"/>
                        <signal group="PCINT0" pad="PB0" function="default"/>
                    </signals>
                </instance>
            </module>
