bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY13.xml
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x3E" size="1" mask="0x3F"/>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
                    <bitfield caption="" mask="0x30" name="EEPM" values="EEP_MODE"/>
                    <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
            <value-group caption="" name="EEP_MODE">
                <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
                <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
                <value caption="Write Only" name="VAL_0x02" value="0x02"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer Low Byte" name="SPL" offset="0x5D" size="1" mask="0xFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Pull-up Disable" mask="0x40" name="PUD"/>
                    <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
                    <bitfield caption="Sleep Mode Select Bits" mask="0x18" name="SM" values="CPU_SLEEP_MODE2"/>
                    <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL2"/>
                </register>
                <register caption="MCU Status register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-On Reset Flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Register" name="OSCCAL" offset="0x51" size="1" mask="0x7F"
                          ocd-rw="R">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x46" size="1" ocd-rw="R">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Debug Wire Data Register" name="DWDR" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57"
                          size="1" ocd-rw="R">
                    <bitfield caption="Clear Temporary Page Buffer" mask="0x10" name="CTPB"/>
                    <bitfield caption="Read Fuse and Lock Bits" mask="0x08" name="RFLB"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_SLEEP_MODE2">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Reserved" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="9.6 MHz" name="9_6_MHz"/>
                <value value="0x01" caption="4.8 MHz" name="4_8_MHz"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Data Register, Port B" name="PORTB" offset="0x38" size="1" mask="0x3F"/>
