bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY13.xml
                <register caption="Data Direction Register, Port B" name="DDRB" offset="0x37" size="1" mask="0x3F"/>
                <register caption="Input Pins, Port B" name="PINB" offset="0x36" size="1" mask="0x3F" ocd-rw="R"/>
            </register-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x5B" size="1">
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
                    <bitfield caption="Pin Change Interrupt Enable" mask="0x20" name="PCIE"/>
                </register>
                <register caption="General Interrupt Flag register" name="GIFR" offset="0x5A" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flag 0" mask="0x40" name="INTF0"/>
                    <bitfield caption="Pin Change Interrupt Flag" mask="0x20" name="PCIF"/>
                </register>
                <register caption="Pin Change Enable Mask" name="PCMSK" offset="0x35" size="1" mask="0x3F"/>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x59" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x08"
                              name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x04"
                              name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x02" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR0" offset="0x58" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x08" name="OCF0B"/>
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x04" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x02" name="TOV0"/>
                </register>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x56" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x4F" size="1">
                    <bitfield caption="Compare Match Output A Mode" mask="0xC0" name="COM0A"/>
                    <bitfield caption="Compare Match Output B Mode" mask="0x30" name="COM0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
                </register>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
                <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x53" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x49" size="1"
                          mask="0xFF"/>
                <register caption="General Timer Conuter Register" name="GTCCR" offset="0x48" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter0" mask="0x01" name="PSR10"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x41" size="1" ocd-rw="R">
                    <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDTIF"/>
                    <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDTIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS"/>
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
