bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY13.xml
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="PDIP8_SOIC8">
            <pin pad="PB5" position="1"/>
            <pin pad="PB3" position="2"/>
            <pin pad="PB4" position="3"/>
            <pin pad="GND" position="4"/>
            <pin pad="PB0" position="5"/>
            <pin pad="PB1" position="6"/>
            <pin pad="PB2" position="7"/>
            <pin pad="VCC" position="8"/>
        </pinout>
        <pinout name="MLF20">
            <pin pad="PB5" position="1"/>
            <pin pad="PB3" position="2"/>
            <pin pad="PB4" position="5"/>
            <pin pad="PB0" position="11"/>
            <pin pad="PB1" position="12"/>
            <pin pad="PB2" position="14"/>
            <pin pad="VCC" position="15"/>
            <pin pad="GND" position="21"/>
        </pinout>
        <pinout name="MLF10">
            <pin pad="PB5" position="1"/>
            <pin pad="PB3" position="2"/>
            <pin pad="PB4" position="4"/>
            <pin pad="GND" position="5"/>
            <pin pad="PB0" position="6"/>
            <pin pad="PB1" position="7"/>
            <pin pad="PB2" position="9"/>
            <pin pad="VCC" position="10"/>
        </pinout>
    </pinouts>
</target-description-file>
